Tekla.Structures.ModelInternal.Dstv.DstvStructure
The dstv class which contains all the dstv information about a part.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.Header
The dstv header.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.HeaderOrder
The order for dstv header .

Tekla.Structures.ModelInternal.Dstv.DstvStructure.Holes
The list with dstv hole blocks.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.Contours
The list with internal and external contour blocks.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.ContourMarks
The list with contour mark blocks

Tekla.Structures.ModelInternal.Dstv.DstvStructure.HardStamp
The hard stamp information.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.BentLines
The list with bent line blocks.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.Filename
The name of the file where the dstv output will be saved.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.FilePath
The path where to save the output file of the dstv.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.FileExtension
The file extension for dstv.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.Precision
The precision used to round the double values.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.Dstv.DstvStructure class with default values.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.#ctor(Tekla.Structures.ModelInternal.Dstv.DstvStructure)
Initializes a new instance of the Tekla.Structures.ModelInternal.Dstv.DstvStructure class using another DstvStructure as an input.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.WriteHeader(System.IO.StreamWriter@)
Used to write the header to the NC file.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.WriteContours(System.IO.StreamWriter@)
Used to write the contours to the NC file.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.WriteHardStamp(Tekla.Structures.ModelInternal.Dstv.DstvNumeration,System.IO.StreamWriter@)
Used to write the hardstamp to the NC file.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.WriteBentLines(System.IO.StreamWriter@)
Used to write the bent line information to the NC file.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.WriteBoltHoles(System.IO.StreamWriter@)
Used to write the holes to the NC file.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.WriteContourMarks(System.IO.StreamWriter@)
Used to write the contour marks to the NC file.

Tekla.Structures.ModelInternal.Dstv.DstvStructure.WriteOutput
Used to write the DstvStructure to the NC file.